# General

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'caskroom/fonts'

# Casks
# cask '1Password'
cask 'appcleaner'
cask 'arduino'
cask 'atom'
cask 'audacity'
cask 'beatport-pro'
# cask 'caffeine'
cask 'cheatsheet'
# cask 'coconutbattery'
cask 'disk-inventory-x'

cask 'docker'
cask 'dropbox'
cask 'duet'

cask 'firefox'
cask 'flux'
# Fonts

cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-signika'
cask 'font-signika-negative'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-ubuntu'
cask 'font-yanone-kaffeesatz'
cask 'font-noto-sans'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'
cask 'font-noto-serif'

cask 'gimp'
cask 'google-chrome'
cask 'gpgtools'
cask 'inkscape'
cask 'jabref'
cask 'java'
cask 'keka'
cask 'latexit'
cask 'libreoffice'
cask 'lighttable'
# cask 'macvim'
cask 'mactex'

cask 'pandoc'

# Use the Mac App Store version until upgrading works
# cask 'slack'
cask 'skim'
cask 'skype'
cask 'spotify'
cask 'texstudio'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'transmission'
cask 'vectr'
cask 'vlc'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'yed'



# Brews

brew 'bash'
brew 'bash-completion'

brew 'vim'
brew 'nano'
brew 'aspell', args: ['with-lang-fr', 'with-lang-en']

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'httpie'
brew 'awscli'
brew 'imapsync'

brew 'binutils'
brew 'coreutils'
brew 'moreutils'
brew 'openssl'

brew 'stow'
brew 'tree'
brew 'pstree'
brew 'p7zip'
brew 'unrar'
brew 'imagemagick'
brew 'lame'
brew 'xz'

brew 'ccache'
brew 'git'
brew 'git-extras'

brew 'gnupg2'
brew 'keybase'
brew 'certbot'

brew 'ant'
brew 'maven'
brew 'gradle'

brew 'go'
brew 'golo'
brew 'groovy'
brew 'scala'
brew 'node'
brew 'python'
brew 'python3'
brew 'kotlin'
brew 'rbenv'
brew 'ruby-build'

brew 'vert.x'

brew 'gnuplot'
brew 'graphviz'
brew 'matplotlib'

brew 'docbook'
brew 'docbook-xsl'

brew 'tree'
